{
    "id": "ivycomb-cybernetic-heart",
    "name": "CYBERNETIC HEART",
    "artist": "ivycomb",
    "date": "29 Jul. 2024",
    "year": 2024,
    "lyrics": "[Intro: Stephanafro]\nLa-da-da-da-da-da\nLa-da-da-da-da-da\nLa-da-da-da, la-da-da-da\nLa-da-da-da-da-da\n[Verse 1: Stephanafro]\nA brain of circuitry\nI feel the sparks enter me\nI put my hand to my heart\nI might be missin' some parts\nMy pulse, a steady hum\nMy chest, a beatless drum\nI wake up only to see\nI breathe electricity\n[Verse 2: Stephanafro]\nOh, am I alive anymore?\nWas there even a before?\nOh, were these parts always my own?\nOr am I only a clone?\n[Verse 3: Stephanafro]\nA sea of endless drones\nSurrounded by the crowd, but I feel alone\nMarchin' on along like we're made for war\nWho am I, what am I made here for?\nMy feet controlled by intangible force\nAn inexplainable source\nBut I must follow its course\n[Verse 4: Stephanafro]\nAround the clock\nWe never stop\nWatched like a hawk\nHe's standin' there at the top\nNo sweat, just shop\nNo thought, livestock\nWe're just his flock\nImprisoned without a lock\n[Verse 5: Stephanafro]\nOh, you knew the risks and agreed\nSuccess was not guaranteed\nOh, it's what my research entails\nYou'll work for me if it fails\nStop this, we're cryin' for release\n'Cause pain still comes with consciousness, I'm beggin' you please\nHave mercy on the mangled minds of subjects who've fallen\nIf saving comes with slaving then whose sins are more rotten?\n[Verse 6: Stephanafro]\nTake a long look at all these figures all around you\n (La-da-da-da-da-da, la-da-da-da-da-da, la-da-da-da, la-da-da-da, la-da-da-da-da-da)\nDo I look troubled by the tasks you have to do? (La-da-da-da-da-da, la-da-da-da-da-da, la-da-da-da, la-da-da-da, la-da-da-da-da-da)\n[Verse 7: Stephanafro]\nBreak out, run fast when the sirens blast\nWe need to get out with our lives before the time has passed\nHe can't control us if we fight against our code en masse\nThere's still a part of you that's fighting back below the mask\nWe're not just robots, we were people tryin' to live our lives\nWe took the gamble, left in shambles when we won no prize\nBehind your eyes still lives the person who had died inside\nHe brought it back and now we're workin' for his enterprise\n[Verse 8: Stephanafro]\nA revolution underground\nWe're screamin' out but make no sound\nI feel a shock, and I fall down\nI look around, we're on the ground\nThe exit doors all come to a close\nAs we lay motionless along the ground\nOur circuits have frozen\nThis whole resurrected life is not the life we had chosen\nBut my hope is not all lost if someone outside here knows it\nSo I send a message out before the final door closes\nThrough a signal send an SOS to those not enclosed\nIn this nightmare",
    "image": "covers/ivycomb-cybernetic-heart.png"
}