{
    "id": "ivycomb-spider-bites",
    "name": "Spider Bites",
    "artist": "ivycomb",
    "date": "30 Nov. 2023",
    "year": 2023,
    "lyrics": "[Verse 1: Stephanafro]\nDo you ever feel life gets a little too frisky?\nI bring back a swing full of intimate love in your head\nI'm not sure if it's the right move to bring it all back\nTo the front of the set with the voice of the pack\nBut I can't say I feel like we need to get\nDown with the beat\n[Verse 2: Stephanafro]\nOne, two, three, four\nOut the door\nThen a five, six, seven, eight\nStayed too late\nDon't bring a bat, I don't want to hit it\nGet too close, and you might get bit\nBoy, I'm not here to yank on your chains\nI'm not cut to be your secretary\nYour trivial pleasure's secondary\nBoy, I'm not here to pull on your reins\nI'm not one to be imaginary\n'Cause fantasy's only temporary\n[Verse 3: Stephanafro]\nEyes up, asserting\nHands out, and flirting\nEvery time I look around and see the same thing\nEverybody playing to the same old routine\nI know I'm stuck\nI'm searching for a way to maybe try my luck, oh no\nI know it's tough\nI'm looking for an answer to a question I don't know\nI can't cut through\nThis feeling that I think I'll never be enough for you\nThis point of view\nIs broken, but I feel I need to prove something to you\n[Verse 4: Stephanafro]\nI guess you're feeling that your life could be a little more frisky?\nI'll hold back this piece of my heart if it means you'll have fun\nI'm not sure if it's the right move to show you I care\nBy performing your script with a passion I don't share\nBut I guess I won't know until I try to get\nDown with the beat\n[Verse 5: Stephanafro]\nBut no, I'm not a perfect little angel either\nOh, a bit of spice can be a little sweeter\nI'll take you back and I'll show you around\nI'll go and take you on a trip so, come on, join if you're down\nDon't hold it back now, you're gonna have fun\nThe party's only starting, yeah, we've barely begun\nStart it slow, don't pick up the tempo\nPlay the strings, criss-cross the fiddle, get a little\nSpice so nice it's twice, thrice, an encore\nScream your name, there's no need to say more\nTurn it up, the thrill should be fatal\nLight a fire, and turn on the tables\nYour face is red, my head's overstimulated\nWords can't do enough to communicate it\nDance into the light of the limelight\nStrike a pose 'cause you are my nightlife\nBe a spy, and I'll be the bad guy\nDo or die, we'll aim for the bullseye\nI don't know what it means\nBut does it even really matter when we're plotting our schemes?\nIt's storming through my veins\nA little water to my wind, we'll make a hurricane\n[Verse 6: Stephanafro]\nShake it up to the ebb and the flow\nTug on a collar, make ya holler\nIf you know, then you know\nWe'll play till the morning light\nBut if you get a bit too close you'll feel my\nSpider bites",
    "image": "covers/ivycomb-spider-bites.jpg"
}