{
    "id": "ivycomb-antivillain",
    "name": "ANTIVILLAIN",
    "artist": "ivycomb",
    "date": "16 Apr. 2024",
    "year": 2024,
    "lyrics": "[Verse 1: Stephanafro]\nHey, sorry, I've just swung back around\nYour face is looking gloomy, you could use a change\nDon't worry, please don't look so down\nYou've got a problem, I've an answer, it's a perfect exchange\nA jack-in-the-box\nYou're gonna pop if they keep twisting slowly\nTrapped in with locks\nIt all can stop if you just listen closely\n[Chorus: Stephanafro]\nWipe out what you've been told\nIt's your choice to be controlled, oh!\nTheir suits aren't made for you\nSo maybe try on out my new worldview\nStep out across the line\nInto a world that's just like mine, oh!\nAscendant to divine\nPerfection isn't just a state of mind\n[Verse 2: Stephanafro]\nTake a long look at all the people all around you\nDo they look happy with the choices that they've made?\nYou question me like I'm the one who called you here\nI'm pretty sure you know the reason's crystal clear\nThey wind you up like you're their cheap little toy\nBut in the end I think we both know that it's all just a ploy\n[Chorus: Stephanafro]\nWipe out what you've been told\nIt's your choice to be controlled, oh!\nTheir suits aren't made for you\nSo maybe try on out my new worldview\nStep out across the line\nInto a world that's just like mine, oh!\nAscendant to divine\nPerfection isn't just a state of mind\n[Verse 3: Stephanafro]\nCrafting a world that will set you free\nIt only costs but a little fee\nJust leave it, it's nothing, I think that you'd agree\nRemove it, just lose it, give up humanity\n[Bridge: Stephanafro]\nNow, sit back, take a deep breath, and relax\nAs I count to three\n(One)\nI've shut the door\n'Cause there was no place for me\n(Two)\nI wanted more\nThan just a life of envy\n(Three)\nI've cut my ties\nNow I've realized\nThat you should too\n[Chorus: ivycomb]\nWipe out what I've been told\nIt's my choice to be controlled, oh!\nTheir suits aren't made for me\nBut this isn't really quite my cup o' tea\nStep out across the line\nInto a world that's truly sublime, oh!\nAscendant to divine\nBut perfection isn't quite what I had in mind\n[Verse 4: ivycomb, \nStephanafro\n, \nivycomb & Stephanafro\n]\nThey're little words, they don't carry a threat\nYet they pull your strings like you're a marionette\nThey say you're not a pawn\nBut you're playing their game\nNo way\nWe'll change the rules\nNo, it won't be the same\nOur way\nTick, tock, there goes the clock\nTickin' on down, no, it ain't gonna stop, no!\n[Verse 5: ivycomb, \nStephanafro\n, \nivycomb & Stephanafro\n]\nYou've made your decision now\nCome on, ditch the club of \"holier than thou\"\nA broken system isn't fixed with a broken solution\nA revolution isn't built without a hint of delusion\nWe shut it down and rebuild from the ground (\nHa, ha\n)\nIt's too late now, we've taken over the town\nWipe out what you've been told\nIt's your choice to be controlled, oh!",
    "image": "covers/ivycomb-antivillain.png"
}