{
    "id": "ivycomb-sahara",
    "name": "SAHARA",
    "artist": "ivycomb",
    "date": "25 Feb. 2024",
    "year": 2024,
    "lyrics": "[Verse 1]\nMy head's on the ground again, I'm bleeding on the sand but I don't feel a thing\nI start with a count to ten, as I pull myself up slowly and I take it in\n[Refrain]\nLost in this desert and I'm looking for freedom\nA small oasis or a moment of breathing\nI'm still alive but I can hear my body screaming\nA broken core despite its pieces interweaving\n[Chorus]\nSCORCH THE SUN, I'M BURNING\nFREEZING NIGHTS, I'M LEARNING\nTO FILL MY CUP OF EMPTINESS\nWITH TIRED LIMBS AND BLOODY FISTS\nON MY OWN, I'LL MAKE IT\nBLOOD AND BONE, I'LL TAKE IT\nBy fighting the coldness inside\nI'm leaving it all to the side\nI'm learning to swallow my pride\nI'M BURNING\n[Break]\nI'M BURNING\nI'M BURNING\n[Rap]\nSurrounded by mirages, nonexistent entourages\nNowhere to roam, there's nothing left to call home, I'm thinking\nI've found it, Nirvana, built it from my own life's trauma\nEach day just, gets hotter, learned to live without the water\n[Verse 2]\nMy head's on the ground again... a feeling too familiar, but this time it stings\nThere's no one to call my friend, but the burden's feeling lighter without their things\nI see on the road ahead, a person walking slowly as my vision fades\nI wake on an empty bed, but I quickly take my leave and I refuse the aid\nNo one can hurt me if I'm walking all alone\nThey can't desert me if I've already turned to stone\n[Refrain]\nLost in this desert and I'm looking for freedom\nA small oasis or a moment of breathing\nI'm still alive but I can hear my body screaming\nA broken core despite its pieces interweaving\n[Chorus]\nSCORCH THE SUN, I'M BURNING\nFREEZING NIGHTS, I'M LEARNING\nTO FILL MY CUP OF EMPTINESS\nWITH TIRED LIMBS AND BLOODY FISTS\nON MY OWN, I'LL MAKE IT\nBLOOD AND BONE, I'LL TAKE IT\nBy fighting the coldness inside\nI'm leaving it all to the side\nI'm learning to swallow my pride\nI'M BURNING\nI'M BURNING, I'M BURNING\nI'M BURNING IT ALL DOWN WITH ME\nI'M BURNING, I'M BURNING\nTHE ONLY WAY I'LL BE SET FREE\n[Rap 2]\nA body that feels foreign to me\nDissonance is soaring through me\nPhysical pain is nothing to the ache that's roaring through me\nI'll do it, I'll do it, anything to get me through it\nHow long can I fake through the agony I take\nAt what point will I break as I fall into it?\n[Verse 3]\nI'm sick of asking if this path will make me who I'm s'posed to be\nIn taking the path less traveled, will the difference be the one I want to see?\nRip my heart out my chest, so I won't be possessed, by the weakness that tries to shut me down\nMy movement has slowed, but I'll never let go, I'll just lift myself each time around\n[Bridge]\nIf I had known that it would be this way\nI would've never put myself this far into the fray\nCause now I'm seeing everything I am today\nIs just a product of the existential price I've paid\nNow there's dust in the wind\nAnd my vision has dimmed\nThe sand has covered my skin\nIs this the end of the end?\nI wipe it from my body but it's starting to blend\nAnd now the only option left is just to soak it in\nIf I was whole would I be more?\nOr does the sum of my parts make me more?\nHow can I compete against this hold?\nCause when I turn up the heat I still feel cold...\n[Break 2]\nI still feel cold...\nI still feel cold...\nI still feel...\n[Verse 4]\nMy head's on the ground again... my body's not the same and I can't feel my skin\nI wrap up my broken limbs and I stand up on my feet but the whole world's spinnin'\n[Refrain]\nLost in this desert and I'm looking for freedom\nA small oasis or a moment of breathing\nI'm still alive but I can hear my body screaming\nA broken core despite its pieces interweaving\n[Verse 5]\nI search and pick up the pieces all to my soul, and I go\nAnd try to fill all the gaps to fix all the holes, I don't know\nHow someone like me, can learn to be free, pay their toll\nWhen they were broken down before they had a chance to be whole\nBut living life isn't a life if you have nothing left to give\nAnd living life isn't a life if you've burned all your reasons left to live\n[Chorus]\nScorching sun...\nFreezing nights, I'm slipping...\nLosing sight... of my... will to fight\nOn my own...\nAll alone, it's ticking\nCounting down, my fading light\nI'm sick of picking myself up off of these burning sands below\nI'm still alive but something died in me ages long ago\nNow my stomach is sick, and I'm hearing the tick, to the next time I fall and hit the ground\nThis time will be quick, no longer equipped to lift myself this time around\n[Outro]\nI've burned it all down as the flames surround me and I fall onto the sand\nLike a shot in the dark I use my last spark for one last deed before the end\nMy head's on the ground again... I try to lift my head but I'm still sinking in\nI lift up a shaky hand, and I say the only word I should've said back then\n\"Help\"",
    "image": "covers/ivycomb-sahara.jpg"
}