{
    "id": "ivycomb-data-reject",
    "name": "DATA_REJECT",
    "artist": "ivycomb",
    "date": "03 Jun. 2024",
    "year": 2024,
    "lyrics": "[Intro]\n-Well since they first tried to contact with us by radio, we've developed a language computer\nA machine that breaks down any language to our own-\n[Verse 1]\nI don't wanna be a construct of\nYour\n fucked-up delusions\nPlease, be honest with me and see\nYour mirror's tinted by green\nWhy do you need to come complicate it?\nIt's just so, it's just so\nIt's just so wasteful to see\n[Verse 2]\nI whisper in the night \nchiroptera\n are my kin\nWhen all the darkness in time starts to crawl underneath my skin\nLost with the hopeless who came before to see retribution in vain\nThe discourse of the world should be driving us insane\n[Verse 3]\n\"We're just too innocent\nBut \nGod's\n got plans so bow to them\nIt's not too late to pick up hope\nLet's eat the \nhats\n and FUCK THE WORLD!\"\n[Verse 4]\nStarry-eyed, why can't you see?\nThat all of you answer to \nme\nDon't be at all obsessive\nJust stick to the plan\nAnd one day you might just be\nMy cute second hand\n[Verse 5]\nI think that I'm just a construct of\nYour fucked-up delusions\nPlease, be honest with yourself now\nYou don't have a damn clue how\nWhy do you need to go complicate it?\nI don't need an explanation why\nI just wanna wait and watch you die\n[Verse 6]\nWhy do they try to be someone that they're not?\nThe clout is poisoning their minds, reducing us all to rot\nAnd when the cloudy sky dissolves and when the white becomes blue\nI'll be pondering my choices, just being a part of you\n[Verse 7]\nIt's not that simple\nCan't we be \namicable\n?\nThere's nuance to see\nBut you won't listen to me\n[Verse 8]\nI was starry-eyed, and I couldn't see\nAll the people here really do love me\nIt's so hard to see when your glasses are tinted by pain\nToo deluded to feel the love through the vein\n[Verse 9]\nThe data's degrading at all-time new highs\nAnd all the melodies in my head converge into their lies\nWhen does all the difference meld into the same?\nThoughts of the future scar each shattered melody in my brain...",
    "image": "covers/ivycomb-data-reject.jpg"
}