{
    "id": "ivycomb-365",
    "name": "365",
    "artist": "ivycomb",
    "date": "10 Aug. 2022",
    "year": 2022,
    "lyrics": "What's up guys, it's ivycomb\nThank you so much for 10,000 subscribers on my music channel and 20,000 listeners on Spotify\nThis is a little gift for all of you for all the continued support\nThank you for 30k combined\nI just wish I could see another perspective\nOne wish is all I ask for to help me with this perplexion\nPlease, just say a word, I need to hear a voice\nPlease, just say a word (Black and white, painted brown and blue)\nI'd hate to ask you twice (I swear I'm like a demon when I'm next to you)\nI'm the ghost that's living inside, and I'm\nWaiting to exorcise your bad habits\nLoading Level 1\nOh my god, I have seen your face\nIt's like I'm lookin' in a mirror, but it's rearranged\nBlack and white, painted brown and blue\nI swear I'm like a demon when I'm next to you\nWading through the undertow, I see\nAll the lights in Tokyo right now\nCross the street, quiet undertones\nJust breathe in the sights\nSense overload\nBrought me here, our coordinance\nAway from the fear\nOf an ordinance right now\nLyin' back down on the low\nJust chillin' out in Tokyo\nNah, you don't care about me do you?\nGot me fishin' for a feelin'\nFriggin' worried about the future\nAlways thinkin' I'd be happy just to know ya\nThen I knew ya, livin' life like it's a movie\nCall me out just like a blooper, I've been\nLivin' like a ghost in the background\nIf you forgot about me imma pull you back 'round\nI've been pushin' things around, just want attention\nI'll never seem to be the one you mention\nI feel like\nI'm the Imposter, I'm sus\nBut there's a bigger threat here among us\nPut on your trench coat and tie\nThese crewmates came out here to die\nAnd the space wind howls\nWhile the bad guys are prowlin'\nCan't finish that task\n'Cause I'm starin' and scowlin'\nDing di-ding di-ding sus\nWelcome to Among Us\nEverything will be alright\nIt's just a joke\nI'm walkin' underneath the starlight\nIt's just a joke\nI know that I will be forgiven\nIt's just a joke\nSo why can't you just listen?\nYou won't listen\nI put on some nice clothes today\nI'm excited to finally put on a happy face\nMy friends and I are gonna go out to play\n[?]\n(Just tell me)\nHey, sorry, I didn't mean to miss your call\nThe radio was busted, air was frozen, I couldn't hear at all\nThe time we spent together was short-sighted and sad like the vision\nOf a seltzer bottle's contours between my homework and in-division, like\nI woke up in the morning feelin' like I couldn't breathe\nBut would that really be so bad? Living lifeless and so free, because\nWhen I was younger, they'd say, \"You should follow your dreams\"\nBut then they'd shoot it down and say, \"that wouldn't let me be free\"\n'Cause—\nI just wish I could see another perspective\nOne wish is all I ask for to help me with this perplexion\nPlease, just say a word, I need to hear a voice\nPlease, just say a word, I'd hate to ask you twice\nThe solar winds are calling from so far\nI don't know whereabouts my soul bits are\nI'll travel 'till the end of the road\nSee the people and the places and the things that I know, all gone\nTake a look 'cause it might be my last\nMy anxiety's inside of me, I'm stuck in the past\nI've got to muster my might\nHide the fear, say farewell to the fright\nI turn my head and I know\nToday I might be starbound, oh\nI'm starbound\nI'm starbound\nI'm starbound\nI'm starbound\nThe solar winds are calling from so far\nRunnin', runnin' away from me\nThere's so much, so much that we could be\nBut you seem terrified of\nWhat you've been feelin' inside, ah\nYou're runnin', runnin' away from me\nLike love is a bad word\nI took the wrong steps, I'm sorry\nBroken and bruised, you worried\nI'm not a criminal, I just\nLost my direction in my life\nLife's fucked up\nIt's really fucked up\nI just want a keyboard\nSo I can make it up\nSticks and bones\nMay break my bones\nBut I broke her heart\nThen I broke his bones\nQuick—quick—quick\nTake pic\nCheck inside of my brain\nCan't develop any colors\n'Cause the ink's all the same\nGot—got a pen\nPaper too\nDon't know what to fuckin' do\nAnswer me this simple riddle 'cause I\nAin't got no clue\nYeah, feelin' so\nFucked up, fucked up, yeah\nSinkin' feelin' in my heart\nGot me feelin'\nFucked up, fucked up-up\nCold\nFeelin' so\nFucked up, fucked up, yeah\nSinkin' feelin' in my heart\nGot me feelin'\nFucked up, fucked up-up\nCold\nI wanted to be like all the other kids\nBut wearin' a mask don't change how it is\nJust wanted to hear you say that you love me\nBut no you don't\nYou know that I was just chillin'\nAfraid to be myself, and I can't fuckin' tell\nWhere my persona ends and the truth begins\nBecause I'm too deep in these lies and I'm fucked up\nCan you coat it in a barrel of nails?\nTake a nap on the train tracks next to the rail\nFeel the wind of an airplane going over Mach 4\nOn a hot floor [?] the pain away\nBecause I'm stuck in the third dimension, on a pension\nNot to mention the tension is gut-wrenchin'\nAnd I don't know why I'd even bother to try when I wake up\nFucked up, fucked up, yeah\nSinkin' feelin' in my heart\nGot me feelin'\nFucked up, fucked up-up\nCold\nFeelin' so\nFucked up, fucked up, yeah\nSinkin' feelin' in my heart\nGot me feelin'\nFucked up, fucked up-up\nCold\nFucked up, fucked up, yeah\nFucked up, fucked up\nFucked up, fucked up, yeah\nI turned myself into a pickle, Morty!\nBoom! Big reveal, I'm a pickle!\nWhat do you think about that? I turned myself into a pi—",
    "image": "covers/ivycomb-365.jpg"
}